
Процедура ПечатьВедомости(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьВедомости)
	Макет = Документы.Ведомость.ПолучитьМакет("ПечатьВедомости");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.ВидКонтроля КАК ВидКонтроля,
	|	Ведомость.Группа КАК Группа,
	|	Ведомость.Дисциплина КАК Дисциплина,
	|	Ведомость.Ответственный КАК Ответственный,
	|	Ведомость.Преподаватель КАК Преподаватель,
	|	Ведомость.УчебныйПериод КАК УчебныйПериод,
	|	Ведомость.СписокСтудентов.(
	|		НомерСтроки КАК НомерСтроки,
	|		Студент КАК Студент,
	|		Оценка КАК Оценка,
	|		Зачет КАК Зачет,
	|		Явка КАК Явка
	|	) КАК СписокСтудентов,
	|	Ведомость.Номер КАК НомерВедомости,
	|	Ведомость.Дата КАК ДатаВедомости
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|ГДЕ
	|	Ведомость.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокСтудентовШапка = Макет.ПолучитьОбласть("СписокСтудентовШапка");
	ОбластьСписокСтудентов = Макет.ПолучитьОбласть("СписокСтудентов");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.ДатаВедомости = Формат(Выборка.ДатаВедомости, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокСтудентовШапка);
		ВыборкаСписокСтудентов = Выборка.СписокСтудентов.Выбрать();
		Пока ВыборкаСписокСтудентов.Следующий() Цикл
			ОбластьСписокСтудентов.Параметры.Заполнить(ВыборкаСписокСтудентов);
			Если Выборка.ВидКонтроля.ТипОценки = Перечисления.ТипыОценки.БалльнаяШкала Тогда
				Если ВыборкаСписокСтудентов.Оценка = 0 Тогда
					ОбластьСписокСтудентов.Параметры.ОценкаМоя = "";
				Иначе ОбластьСписокСтудентов.Параметры.ОценкаМоя = ВыборкаСписокСтудентов.Оценка;
				КонецЕсли;
			Иначе ОбластьСписокСтудентов.Параметры.ЗачетМоя = Формат(ВыборкаСписокСтудентов.Зачет, "БЛ=незачет; БИ=зачет");
			КонецЕсли;
			ОбластьСписокСтудентов.Параметры.ЯвкаМоя = Формат(ВыборкаСписокСтудентов.Явка, "БЛ=-; БИ=+");
			ТабДок.Вывести(ОбластьСписокСтудентов, ВыборкаСписокСтудентов.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
