
&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	ДанныеСотрудника = ПолучитьДанныеСотрудника(Элементы.СписокСотрудников.ТекущиеДанные.Сотрудник);
	ЗанестиДанныеСотрудника(ДанныеСотрудника);
	
	Элементы.СписокСотрудников.ТекущиеДанные.ДатаПриема = Объект.Дата; 
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеСотрудника(ДанныеСотрудника)
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудника(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	Возврат ДанныеСотрудника;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСотрудник из Объект.СписокСотрудников Цикл
		ДанныеСотрудника = ПолучитьДанныеСотрудникаИзФормы(СтрочкаСотрудник);
		ЗаписатьДанныеНаСотрудника(СтрочкаСотрудник.Сотрудник, ДанныеСотрудника);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеСотрудникаИзФормы(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	Возврат ДанныеСотрудника;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеНаСотрудника(Сотрудник, ДанныеСотрудника)
	СотрудникСсылка = Сотрудник;
	СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		СотрудникОбъект.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		СотрудникОбъект.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		СотрудникОбъект.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
	
	СотрудникОбъект.СтатусСотрудника = Перечисления.СтатусыСотрудника.Работает;
	
	СотрудникОбъект.Записать();
КонецПроцедуры

