
&НаКлиенте
Процедура ОткрытьФормуПриказа(Команда)
	НазваниеКоманды = Команда.Имя;
	Если НазваниеКоманды = "Зачислить" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаЗачисление"); 
	ИначеЕсли НазваниеКоманды = "Отчислить" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаОтчисление"); 
	ИначеЕсли НазваниеКоманды = "Восстановить" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаВосстановление"); 
	ИначеЕсли НазваниеКоманды = "Выпустить" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаВыпуск"); 
	ИначеЕсли НазваниеКоманды = "ДругойКурс" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаДругойКурс"); 
	ИначеЕсли НазваниеКоманды = "ДругаяГруппа" Тогда
		ОткрытьФорму("Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаДругаяГруппа"); 
	КонецЕсли;
КонецПроцедуры
