
&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	ДанныеСотрудника = ПолучитьДанныеСотрудника(Элементы.СписокСотрудников.ТекущиеДанные.Сотрудник);
	ЗанестиДанныеСотрудника(ДанныеСотрудника);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудника(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	ДанныеСотрудника.Вставить("ДатаНачалаРаботы", Сотрудник.ДатаНачалаРаботы);
	Возврат ДанныеСотрудника;
КонецФункции

&НаКлиенте
Процедура ЗанестиДанныеСотрудника(ДанныеСотрудника)
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаНачалаРаботы) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачала = ДанныеСотрудника.ДатаНачалаРаботы;
	КонецЕсли;
КонецПроцедуры