
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		// Заполнение шапки
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		ИНН = ДанныеЗаполнения.ИНН;
		Код = ДанныеЗаполнения.Код;
		МедПолисНомер = ДанныеЗаполнения.МедПолисНомер;
		МедПолисСерия = ДанныеЗаполнения.МедПолисСерия;
		Наименование = ДанныеЗаполнения.Наименование;
		Паспорт = ДанныеЗаполнения.Паспорт;
		Пол = ДанныеЗаполнения.Пол;
		СНИЛС = ДанныеЗаполнения.СНИЛС;
		ФизЛицо = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
