
&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ДанныеФизЛица = ПолучитьДанныеФизЛица(Объект.ФизЛицо);
	ЗанестиДанныеФизЛица(ДанныеФизЛица);
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеФизЛица(ДанныеФизЛица)
	Если ДанныеФизЛица.ФИО <> "" Тогда
		Объект.Наименование = ДанныеФизЛица.ФИО;
	КонецЕсли;
	
	Если ДанныеФизЛица.ДатаРождения <> "" Тогда
		Объект.ДатаРождения = ДанныеФизЛица.ДатаРождения;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФизЛица(ФизЛицо)
	ДанныеФизЛица = Новый Структура;
	ДанныеФизЛица.Вставить("ФИО", ФизЛицо.Наименование);
	ДанныеФизЛица.Вставить("ДатаРождения", ФизЛицо.ДатаРождения);
	Возврат ДанныеФизЛица;
КонецФункции
