
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСправкиОбОбучении)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСправкиОбОбучении(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Печать справки об обучении");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьСправкиОбОбучении(ТабДок, ПараметрКоманды)
	Документы.СправкаОбОбучении.ПечатьСправкиОбОбучении(ТабДок, ПараметрКоманды);
КонецПроцедуры
