
&НаКлиенте
Процедура ВидКонтроляПриИзменении(Элемент)
	Объект.ИсходнаяОценка = 0;
	Объект.Зачет = ЛОЖЬ;
	
	Если ПолучитьТипОценки(Объект.ВидКонтроля) = ПолучитьВсеТипыОценки().БалльнаяШкала Тогда
		Элементы.Зачет.Видимость = ЛОЖЬ;
		Элементы.Оценка.Видимость = ИСТИНА;
	Иначе
		Элементы.Зачет.Видимость = ИСТИНА;
		Элементы.Оценка.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТипОценки(ВидКонтроля)
	Возврат ВидКонтроля.ТипОценки;
КонецФункции

&НаСервере
Функция ПолучитьВсеТипыОценки()
	Стр =  Новый Структура;
	Стр.Вставить("БалльнаяШкала", Перечисления.ТипыОценки.БалльнаяШкала);
	Стр.Вставить("ЗачетНезачет", Перечисления.ТипыОценки.ЗачетНезачет);
	Возврат Стр;
КонецФункции