
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетПосещений
	Движения.УчетПосещений.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПосещения Из СписокПосещения Цикл
		Движение = Движения.УчетПосещений.Добавить();
		Движение.Период = ПериодРегистрации;
		Движение.Студент = ТекСтрокаСписокПосещения.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Преподаватель = Преподаватель;
		Движение.День1 = ТекСтрокаСписокПосещения.День1;
		Движение.День2 = ТекСтрокаСписокПосещения.День2;
		Движение.День3 = ТекСтрокаСписокПосещения.День3;
		Движение.День4 = ТекСтрокаСписокПосещения.День4;
		Движение.День5 = ТекСтрокаСписокПосещения.День5;
		Движение.День6 = ТекСтрокаСписокПосещения.День6;
		Движение.День7 = ТекСтрокаСписокПосещения.День7;
		Движение.День8 = ТекСтрокаСписокПосещения.День8;
		Движение.День9 = ТекСтрокаСписокПосещения.День9;
		Движение.День10 = ТекСтрокаСписокПосещения.День10;
		Движение.День11 = ТекСтрокаСписокПосещения.День11;
		Движение.День12 = ТекСтрокаСписокПосещения.День12;
		Движение.День13 = ТекСтрокаСписокПосещения.День13;
		Движение.День14 = ТекСтрокаСписокПосещения.День14;
		Движение.День15 = ТекСтрокаСписокПосещения.День15;
		Движение.День16 = ТекСтрокаСписокПосещения.День16;
		Движение.День17 = ТекСтрокаСписокПосещения.День17;
		Движение.День18 = ТекСтрокаСписокПосещения.День18;
		Движение.День19 = ТекСтрокаСписокПосещения.День19;
		Движение.День20 = ТекСтрокаСписокПосещения.День20;
		Движение.День21 = ТекСтрокаСписокПосещения.День21;
		Движение.День22 = ТекСтрокаСписокПосещения.День22;
		Движение.День23 = ТекСтрокаСписокПосещения.День23;
		Движение.День24 = ТекСтрокаСписокПосещения.День24;
		Движение.День25 = ТекСтрокаСписокПосещения.День25;
		Движение.День26 = ТекСтрокаСписокПосещения.День26;
		Движение.День27 = ТекСтрокаСписокПосещения.День27;
		Движение.День28 = ТекСтрокаСписокПосещения.День28;
		Движение.День29 = ТекСтрокаСписокПосещения.День29;
		Движение.День30 = ТекСтрокаСписокПосещения.День30;
		Движение.День31 = ТекСтрокаСписокПосещения.День31;
		Движение.Причина = ТекСтрокаСписокПосещения.Причина;
		Движение.КолНеуваж = ТекСтрокаСписокПосещения.КолНеуваж;
		Движение.КолУваж = ТекСтрокаСписокПосещения.КолУваж;
		Движение.КолБолел = ТекСтрокаСписокПосещения.КолБолел;
		Движение.КолОпоздал = ТекСтрокаСписокПосещения.КолОпоздал;
	КонецЦикла;

	// регистр КоличествоПосещений Приход
	Движения.КоличествоПосещений.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПосещения Из СписокПосещения Цикл
		Движение = Движения.КоличествоПосещений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Студент = ТекСтрокаСписокПосещения.Студент;
		Движение.КолНеуваж = ТекСтрокаСписокПосещения.КолНеуваж;
		Движение.КолУваж = ТекСтрокаСписокПосещения.КолУваж;
		Движение.КолБолел = ТекСтрокаСписокПосещения.КолБолел;
		Движение.КолОпоздал = ТекСтрокаСписокПосещения.КолОпоздал;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
