
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеКонтингента
	Движения.ДвижениеКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСтудентов Из СписокСтудентов Цикл
		Движение = Движения.ДвижениеКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Студенты = ТекСтрокаСписокСтудентов.Студент;
		Движение.Статус = СтатусСтудента;
		Движение.Группа = ЗачислениеВГруппу;
		Движение.ВидФинансирования = ТекСтрокаСписокСтудентов.ВидФинансирования;
		Движение.НаименованиеГруппы = ЗачислениеВГруппу;
	КонецЦикла;

	// регистр КурсыУчебныхГрупп
	Движения.КурсыУчебныхГрупп.Записывать = Истина;
	Движение = Движения.КурсыУчебныхГрупп.Добавить();
	Движение.Период = Дата;
	Движение.УчебнаяГруппа = ЗачислениеВГруппу;
	Движение.Курс = Курс;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
