
Процедура ПечатьНаправленияНаПересдачу(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьНаправленияНаПересдачу)
	Макет = Документы.НаправлениеНаПересдачу.ПолучитьМакет("ПечатьНаправленияНаПересдачу");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаправлениеНаПересдачу.Дата КАК Дата,
	|	НаправлениеНаПересдачу.Номер КАК Номер,
	|	НаправлениеНаПересдачу.ДействуетС КАК ДействуетС,
	|	НаправлениеНаПересдачу.ДействуетПо КАК ДействуетПо,
	|	НаправлениеНаПересдачу.Студент КАК Студент,
	|	НаправлениеНаПересдачу.Группа КАК Группа,
	|	НаправлениеНаПересдачу.Дисциплина КАК Дисциплина,
	|	НаправлениеНаПересдачу.Преподаватель КАК Преподаватель,
	|	НаправлениеНаПересдачу.УчебныйПериод КАК УчебныйПериод,
	|	НаправлениеНаПересдачу.Оценка КАК Оценка,
	|	НаправлениеНаПересдачу.Зачет КАК Зачет,
	|	НаправлениеНаПересдачу.ВидКонтроля КАК ВидКонтроля
	|ИЗ
	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
	|ГДЕ
	|	НаправлениеНаПересдачу.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТелоПересдачи = Макет.ПолучитьОбласть("ТелоПересдачи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ДействуетС = Формат(Выборка.ДействуетС, "ДФ=dd.MM.yyyy");
		Шапка.Параметры.ДействуетПо = Формат(Выборка.ДействуетПо, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТелоПересдачи.Параметры.Заполнить(Выборка);
		Если Выборка.ВидКонтроля.ТипОценки = Перечисления.ТипыОценки.БалльнаяШкала Тогда
			ТелоПересдачи.Параметры.ОценкаМоя = Выборка.Оценка;
		Иначе ТелоПересдачи.Параметры.ЗачетМоя = Формат(Выборка.Зачет, "БЛ=незачет; БИ=зачет");
		КонецЕсли;
		ТабДок.Вывести(ТелоПересдачи, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
