
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Движение = Движения.ОценкиСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Группа = Группа;
	Движение.УчебныйПериод = УчебныйПериод;
	Движение.Дисциплина = Дисциплина;
	Движение.ВидКонтроля = ВидКонтроля;
	Движение.Преподаватель = Преподаватель;
	Движение.Оценка = Оценка;
	Движение.Зачет = Зачет;
	Движение.Явка = Явка;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
