
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеСотрудников
	Движения.ДвижениеСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ДвижениеСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Должность = ТекСтрокаСписокСотрудников.Должность;
		Движение.Подразделение = ТекСтрокаСписокСотрудников.Подразделение;
		Движение.ЗанимаемыхСтавок = ТекСтрокаСписокСотрудников.ЗанимаемыхСтавок;
		Движение.СтатусСотрудника = Перечисления.СтатусыСотрудника.Работает;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
