
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	ДанныеСтудента = ПолучитьДанныеСтудента(Объект.Студент, Объект.Дата);
	ЗанестиДанныеСтудента(ДанныеСтудента);
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеСтудента(ДанныеСтудента)
	Если ЗначениеЗаполнено(ДанныеСтудента.ФИО) Тогда
		Объект.ФИОДтПд = ДанныеСтудента.ФИО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.ДатаРождения) Тогда
		Объект.ДатаРождения = ДанныеСтудента.ДатаРождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Специальность) Тогда
		Объект.СпециальностьСтудента = ДанныеСтудента.Специальность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ГодПоступления) Тогда
		Объект.ГодПоступления = ДанныеСтудента.ГодПоступления;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ФормаОбучения) Тогда
		Объект.ФормаОбучения = ДанныеСтудента.ФормаОбучения;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ВидФинансирования) Тогда
		Объект.ВидФинансирования = ДанныеСтудента.ВидФинансирования;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Курс) Тогда
		Объект.КурсСтудента = ДанныеСтудента.Курс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Группа) Тогда
		Объект.УчебнаяГруппа = ДанныеСтудента.Группа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Приказ) Тогда
		Объект.Приказ = ПолучитьДокументДвижения(ДанныеСтудента.Приказ.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументДвижения(НомерДокумента)
	Возврат Документы.ПриказОДвиженииКонтингета.НайтиПоНомеру(НомерДокумента);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтудента(Студент, АктуальнаяДата)
	ДанныеСтудента = Новый Структура;
	ДанныеСтудента.Вставить("ФИО", Студент.Наименование);
	ДанныеСтудента.Вставить("ДатаРождения", Студент.ДатаРождения);
	ДанныеСтудента.Вставить("Специальность", Студент.Специальность);
	ДанныеСтудента.Вставить("ГодПоступления", Студент.ГодПоступления);
	ДанныеСтудента.Вставить("ФормаОбучения", Студент.ТекущаяПрограммаОбучения.ФормаОбучения);
	ДанныеСтудента.Вставить("ВидФинансирования", Студент.ВидФинансирования);
	ДанныеСтудента.Вставить("Курс", Студент.Курс);
	ДанныеСтудента.Вставить("Группа", Студент.УчебнаяГруппа);
	ДанныеСтудента.Вставить("Приказ", ПолучитьПоследнийПриказЗачисления(Студент));
	Возврат ДанныеСтудента;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоследнийПриказЗачисления(Студент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеКонтингента.Регистратор.Номер КАК НомерПриказа,
		|	ДвижениеКонтингента.Регистратор.Дата КАК ДатаПриказа
		|ИЗ
		|	РегистрСведений.ДвижениеКонтингента КАК ДвижениеКонтингента
		|ГДЕ
		|	ДвижениеКонтингента.Студенты = &Студент
		|	И ДвижениеКонтингента.Регистратор.ВидПриказа = &ВидПриказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеКонтингента.Регистратор.Номер,
		|	ДвижениеКонтингента.Регистратор.Дата";
	Запрос.УстановитьПараметр("Студент", Студент);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ВидыПриказов.Зачисление);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Приказ = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Приказ.Вставить("Номер", ВыборкаДетальныеЗаписи.НомерПриказа);
		Приказ.Вставить("Дата", ВыборкаДетальныеЗаписи.ДатаПриказа);
	КонецЦикла;
	Возврат Приказ;
КонецФункции
