&НаКлиенте
Процедура СправочникОрг(Команда)
	ОсновнаяОрганизация = ПредопределенноеЗначение("Справочник.Организации.ОсновнаяОрганизация");
	Реквизит1 = ОсновнаяОрганизация;
	ЭтаФорма.Заголовок = ОсновнаяОрганизация;
	НаСерваке();
КонецПроцедуры

&НаСервере
Процедура НаСерваке()
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы", "", Заголовок); 
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", Заголовок); 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОрганизацию(Команда)
	СсылкаНаЭлементСправочника = ПредопределенноеЗначение("Справочник.Организации.ОсновнаяОрганизация");
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлементСправочника);
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры
