
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Фамилия = ФамилияИмяОтчество(Объект.Наименование).Фамилия;
	Объект.Имя = ФамилияИмяОтчество(Объект.Наименование).Имя;
	Объект.Отчество = ФамилияИмяОтчество(Объект.Наименование).Отчество;
КонецПроцедуры

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
    
    Результат = Новый Массив;
    
    // для обеспечения обратной совместимости

    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //

    
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
    
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция ФамилияИмяОтчество(Знач ФИО) Экспорт
    
    СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
    
    МассивПодстрок = РазложитьСтрокуВМассивПодстрок(ФИО, " ");
    
    Если МассивПодстрок.Количество() > 0 Тогда
        СтруктураФИО.Вставить("Фамилия", МассивПодстрок[0]);
        Если МассивПодстрок.Количество() > 1 Тогда
            СтруктураФИО.Вставить("Имя", МассивПодстрок[1]);
        КонецЕсли;
        Если МассивПодстрок.Количество() > 2 Тогда
            Отчество = "";
            Для Шаг = 2 По МассивПодстрок.Количество()-1 Цикл
                Отчество = Отчество + МассивПодстрок[Шаг] + " ";
			КонецЦикла;
            Отчество = СокрП(Отчество);
            СтруктураФИО.Вставить("Отчество", Отчество);
        КонецЕсли;
    КонецЕсли;
    
    Возврат СтруктураФИО;
    
КонецФункции
