
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСтудентов Из СписокСтудентов Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаСписокСтудентов.Студент;
		Движение.Группа = Группа;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.Дисциплина = Дисциплина;
		Движение.ВидКонтроля = ВидКонтроля;
		Движение.Преподаватель = Преподаватель;
		Движение.Оценка = ТекСтрокаСписокСтудентов.Оценка;
		Движение.Зачет = ТекСтрокаСписокСтудентов.Зачет;
		Движение.Явка = ТекСтрокаСписокСтудентов.Явка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
