
&НаКлиенте
Процедура Обновить(Команда)
	КомФинСтудентов = ПолучитьСтудентов("Коммерческое");
	БюдФинСтудентов = ПолучитьСтудентов("Бюджетное");
	ОбщКолСтудентов = БюдФинСтудентов + КомФинСтудентов;
	
	ПостроитьДинамикуНаСервере();
	ПостроитьФормуОбученияНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтудентов(ВидФин)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.СтатусСтудента = &СтатусСтудента
	|	И Студенты.ВидФинансирования = &ВидФин";
	
	Запрос.УстановитьПараметр("СтатусСтудента", Перечисления.СтатусыСтудента.Студент);
	
	Если ВидФин = "Коммерческое" Тогда
		Запрос.УстановитьПараметр("ВидФин", Перечисления.ВидыФинансирования.КоммерческоеФинансирование);
	ИначеЕсли ВидФин = "Бюджетное" Тогда
		Запрос.УстановитьПараметр("ВидФин", Перечисления.ВидыФинансирования.БюджетноеФинансирование);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	КоличествоСтудентов = РезультатЗапроса.Количество;
	Возврат КоличествоСтудентов;
КонецФункции

&НаСервере
Процедура ПостроитьДинамикуНаСервере()
	Динамика.Очистить();
	Динамика.АвтоТранспонирование = Ложь;
	Динамика.Обновление = Ложь;
	
	Платников = ПолучитьСтудентов("Коммерческое");
	Бюджетников = ПолучитьСтудентов("Бюджетное");
	ВсегоСтудентов = Платников + Бюджетников;

	Точка = Динамика.УстановитьТочку("Количество студентов");
	
	Серия = Динамика.Серии.Добавить("Всего студентов");	
	Динамика.УстановитьЗначение(Точка, Серия, ВсегоСтудентов, "Всего студентов", Строка(ВсегоСтудентов) + " студентов");
	
	Серия = Динамика.Серии.Добавить("Платников");	
	Динамика.УстановитьЗначение(Точка, Серия, Платников, "Платников", Строка(Платников) + " платников");
	
	Серия = Динамика.Серии.Добавить("Бюджетников");	
	Динамика.УстановитьЗначение(Точка, Серия, Бюджетников, "Бюджетников", Строка(Бюджетников) + " бюджетников");
КонецПроцедуры 

&НаСервере
Процедура ПостроитьФормуОбученияНаСервере()
	ДиаграммаФО.Очистить();
	ДиаграммаФО.АвтоТранспонирование = Ложь;
	ДиаграммаФО.Обновление = Ложь;
	
	Очников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.Очная);
	Заочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.Заочная);
	ОчноЗаочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.ОчноЗаочная);
	
	Точка = ДиаграммаФО.УстановитьТочку("Количество студентов");
	
	Серия1 = ДиаграммаФО.Серии.Добавить("Очников ");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия1, Очников, "Очников", Строка(Очников) + " очников");
	
	Серия2 = ДиаграммаФО.Серии.Добавить("Заочников");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия2, Заочников, "Заочников", Строка(Заочников) + " заочников");
	
	Серия3 = ДиаграммаФО.Серии.Добавить("Очно-заочников");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия3, ОчноЗаочников, "Очно-заочников", Строка(ОчноЗаочников) + " очно-заочников");
КонецПроцедуры 

&НаСервере
Функция ПолучитьКоличествоПоФормеОбучения(ФормаОбучения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.СтатусСтудента = &СтатусСтудента
	|	И Студенты.ТекущаяПрограммаОбучения.ФормаОбучения = &ФормаОбучения";
	
	Запрос.УстановитьПараметр("СтатусСтудента", Перечисления.СтатусыСтудента.Студент);
	Запрос.УстановитьПараметр("ФормаОбучения", ФормаОбучения);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	КоличествоСтудентов = РезультатЗапроса.Количество;
	Возврат КоличествоСтудентов;
КонецФункции

