
Функция ПолучитьГруппуСтудента(АктуальнаяДата, Студент) Экспорт
	Отбор = Новый Структура("Студенты", Студент);
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ДвижениеКонтингента.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначенияРесурсов.Группа;
КонецФункции

Функция ПолучитьФормуИзВидаПриказа(ВыбранныйПриказ) Экспорт
	ВидыПриказов = ПолучитьВидыПриказов();

	ФормыДокумента = Новый Структура;
	ФормыДокумента.Вставить("Зачисление", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаЗачисление");
	ФормыДокумента.Вставить("Отчисление", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаОтчисление");
	ФормыДокумента.Вставить("Восстановление", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаВосстановление");
	ФормыДокумента.Вставить("Выпуск", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаВыпуск");
	ФормыДокумента.Вставить("ДругаяГруппа", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаДругаяГруппа");
	ФормыДокумента.Вставить("ДругойКурс", "Документ.ПриказОДвиженииКонтингета.Форма.ФормаДокументаДругойКурс");

	Если ВыбранныйПриказ = ВидыПриказов.Зачисление Тогда
		Возврат ФормыДокумента.Зачисление;
	ИначеЕсли ВыбранныйПриказ = ВидыПриказов.Отчисление Тогда
		Возврат ФормыДокумента.Отчисление;
	ИначеЕсли ВыбранныйПриказ = ВидыПриказов.Восстановление Тогда
		Возврат ФормыДокумента.Восстановление;
	ИначеЕсли ВыбранныйПриказ = ВидыПриказов.Выпуск Тогда
		Возврат ФормыДокумента.Выпуск;
	ИначеЕсли ВыбранныйПриказ = ВидыПриказов.ПереводНаДругойКурс Тогда
		Возврат ФормыДокумента.ДругойКурс;
	ИначеЕсли ВыбранныйПриказ = ВидыПриказов.ПереводВДругуюГруппу Тогда
		Возврат ФормыДокумента.ДругаяГруппа;
	КонецЕсли;
КонецФункции

Функция ПолучитьВидыПриказов() Экспорт
	ВидыПриказов = Новый Структура;
	ВидыПриказов.Вставить("Зачисление", Перечисления.ВидыПриказов.Зачисление);
	ВидыПриказов.Вставить("Отчисление", Перечисления.ВидыПриказов.Отчисление);
	ВидыПриказов.Вставить("Восстановление", Перечисления.ВидыПриказов.Восстановление);
	ВидыПриказов.Вставить("Выпуск", Перечисления.ВидыПриказов.Выпуск);
	ВидыПриказов.Вставить("ПереводНаДругойКурс", Перечисления.ВидыПриказов.ПереводНаДругойКурс);
	ВидыПриказов.Вставить("ПереводВДругуюГруппу", Перечисления.ВидыПриказов.ПереводВДругуюГруппу);
	Возврат ВидыПриказов;
КонецФункции

Функция ПолучитьСтатусыСтудента() Экспорт
	Статусы = Новый Структура;
	Статусы.Вставить("Абитуриент", Перечисления.СтатусыСтудента.Абитуриент);
	Статусы.Вставить("Студент", Перечисления.СтатусыСтудента.Студент);
	Статусы.Вставить("Отчислен", Перечисления.СтатусыСтудента.Отчислен);
	Статусы.Вставить("Выпущен", Перечисления.СтатусыСтудента.Выпущен);
	Возврат Статусы;
КонецФункции
