
&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	Элементы.СписокСотрудников.ТекущиеДанные.ДатаУвольнения = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСотрудник из Объект.СписокСотрудников Цикл
		ЗаписатьДанныеНаСотрудника(СтрочкаСотрудник.Сотрудник);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеНаСотрудника(Сотрудник)
	СотрудникСсылка = Сотрудник;
	СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
	
	СотрудникОбъект.Подразделение = "";
	СотрудникОбъект.Должность = "";
	СотрудникОбъект.ЗанимаемыхСтавок = "";
	СотрудникОбъект.СтатусСотрудника = Перечисления.СтатусыСотрудника.Уволен;
	
	СотрудникОбъект.Записать();
КонецПроцедуры