
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Студенты") Тогда
		// Заполнение шапки
		ВидФинансирования = ДанныеЗаполнения.ВидФинансирования;
		ГодПоступления = ДанныеЗаполнения.ГодПоступления;
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		КурсСтудента = ДанныеЗаполнения.Курс;
		ФИОДтПд = ДанныеЗаполнения.Наименование;
		СпециальностьСтудента = ДанныеЗаполнения.Специальность;
		Студент = ДанныеЗаполнения.Ссылка;
		УчебнаяГруппа = ДанныеЗаполнения.УчебнаяГруппа;
		ФормаОбучения = ДанныеЗаполнения.Ссылка.ТекущаяПрограммаОбучения.ФормаОбучения;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры