
&НаКлиенте
Процедура ЗаполнитьГруппу(Команда)
	Если ЗначениеЗаполнено(Объект.УчебнаяГруппа) Тогда
		ЗаполнитьГруппуНаСервере(Объект.УчебнаяГруппа);
	Иначе Сообщить("Группа не выбрана!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуНаСервере(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Студент,
		|	Студенты.УчебнаяГруппа КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.УчебнаяГруппа = &УчебнаяГруппа;";
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
        НовСтр = Объект.СписокПосещения.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СписокПосещенияДеньПриИзменении(Элемент)
	УвеличитьКолИтоги(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКолИтоги(Знач Элемент)
	Перем Статусы;
	Статусы = ПолучитьСтатусыПосещения();
	
	Если Элемент.ТекстРедактирования = Строка(Статусы.н) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолНеуваж = Элементы.СписокПосещения.ТекущиеДанные.КолНеуваж + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.п) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолУваж = Элементы.СписокПосещения.ТекущиеДанные.КолУваж + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.б) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолБолел = Элементы.СписокПосещения.ТекущиеДанные.КолБолел + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.о) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолОпоздал = Элементы.СписокПосещения.ТекущиеДанные.КолОпоздал + 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусыПосещения()
	Статусы = Новый Структура;
	Статусы.Вставить("н",Перечисления.Посещаемость.н);
	Статусы.Вставить("п",Перечисления.Посещаемость.п);
	Статусы.Вставить("б",Перечисления.Посещаемость.б);
	Статусы.Вставить("о",Перечисления.Посещаемость.о);
	Возврат Статусы;
КонецФункции


