
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьВедомости)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьВедомости(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьВедомости(ТабДок, ПараметрКоманды)
	Документы.Ведомость.ПечатьВедомости(ТабДок, ПараметрКоманды);
КонецПроцедуры
