
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриказОДвиженииКонтингета.ПолучитьМакет("ПриказЗачисления");
	
	// заполнение параметров шапки
	ДанныеОрганизации = ПолучитьДанныеОрганизации();
	Макет.Параметры.Учредитель = ДанныеОрганизации.Учредитель;
	Макет.Параметры.НаименованиеПолное = ДанныеОрганизации.НаименованиеПолное;
	Макет.Параметры.КраткоеНаименование = ДанныеОрганизации.КраткоеНаименование;
	Макет.Параметры.Город = ДанныеОрганизации.Город;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОДвиженииКонтингета.Заголовок,
	|	ПриказОДвиженииКонтингета.Формулировка,
	|	ПриказОДвиженииКонтингета.Основание,
	|	ПриказОДвиженииКонтингета.СписокСтудентов.(
	|		Студент,
	|		ВидФинансирования
	|	),
	|	ПриказОДвиженииКонтингета.ПодписиДокумента.(
	|		Сотрудник,
	|		Должность
	|	)
	|ИЗ
	|	Документ.ПриказОДвиженииКонтингета КАК ПриказОДвиженииКонтингета
	|ГДЕ
	|	ПриказОДвиженииКонтингета.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Формулировка = Макет.ПолучитьОбласть("Формулировка");
	Основание = Макет.ПолучитьОбласть("Основание");
	ОбластьСписокСтудентовШапка = Макет.ПолучитьОбласть("СписокСтудентовШапка");
	ОбластьСписокСтудентов = Макет.ПолучитьОбласть("СписокСтудентов");
	ОбластьПодписиДокумента = Макет.ПолучитьОбласть("ПодписиДокумента");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Истина;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		 
		Заголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Заголовок, Выборка.Уровень());
		
		Формулировка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Формулировка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокСтудентовШапка);
		ВыборкаСписокСтудентов = Выборка.СписокСтудентов.Выбрать();
		Пока ВыборкаСписокСтудентов.Следующий() Цикл
			ОбластьСписокСтудентов.Параметры.Заполнить(ВыборкаСписокСтудентов);
			ТабДок.Вывести(ОбластьСписокСтудентов, ВыборкаСписокСтудентов.Уровень());
		КонецЦикла;
		
		Основание.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Основание, Выборка.Уровень());
		
		ВыборкаПодписиДокумента = Выборка.ПодписиДокумента.Выбрать();
		Пока ВыборкаПодписиДокумента.Следующий() Цикл
			ОбластьПодписиДокумента.Параметры.Заполнить(ВыборкаПодписиДокумента);
			ТабДок.Вывести(ОбластьПодписиДокумента, ВыборкаПодписиДокумента.Уровень());
		КонецЦикла;
		
		//ВставлятьРазделительСтраниц = Ложь;
	КонецЦикла;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//}}
КонецПроцедуры

Функция ПолучитьДанныеОрганизации()
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Учредитель", Справочники.Организации.ОсновнаяОрганизация.Учредитель);
	ДанныеОрганизации.Вставить("НаименованиеПолное", Справочники.Организации.ОсновнаяОрганизация.НаименованиеПолное);
	ДанныеОрганизации.Вставить("КраткоеНаименование", Справочники.Организации.ОсновнаяОрганизация.КраткоеНаименование);
	ДанныеОрганизации.Вставить("Город", Справочники.Организации.ОсновнаяОрганизация.город);
	Возврат ДанныеОрганизации;
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
		Если Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Зачисление Тогда
			ВыбраннаяФорма = "ФормаДокументаЗачисление";
		ИначеЕсли Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Отчисление Тогда
			ВыбраннаяФорма = "ФормаДокументаОтчисление";
		ИначеЕсли Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Восстановление Тогда
			ВыбраннаяФорма = "ФормаДокументаВосстановление";
		ИначеЕсли Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Выпуск Тогда
			ВыбраннаяФорма = "ФормаДокументаВыпуск";
		ИначеЕсли Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().ПереводНаДругойКурс Тогда
			ВыбраннаяФорма = "ФормаДокументаДругойКурс";
		ИначеЕсли Параметры.Ключ.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().ПереводВДругуюГруппу Тогда
			ВыбраннаяФорма = "ФормаДокументаДругаяГруппа";
		Иначе
			ВыбраннаяФорма = "ФормаДокументаЗачисление"; // если форма не определено, то откроем зачисление
		КонецЕсли;
		ДополнительнаяИнформация.ПовторноеИспользование = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры






