
&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ДанныеФизЛица = ПолучитьДанныеФизЛица(Объект.ФизЛицо);
	ЗанестиДанныеФизЛица(ДанныеФизЛица);
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеФизЛица(ДанныеФизЛица)
	// в условиях проверяется, чтобы значение было не пустое
	// если значение пусто, то оно не добавляется
	// проверка сделана для того, чтобы не удалять значения, которые ввел пользователь сам
	
	Если ДанныеФизЛица.ФИО <> "" Тогда
		Объект.Наименование = ДанныеФизЛица.ФИО;
	КонецЕсли;
	
	Если ДанныеФизЛица.ДатаРождения <> "" Тогда
		Объект.ДатаРождения = ДанныеФизЛица.ДатаРождения;
	КонецЕсли;
	
	Если ДанныеФизЛица.Пол <> "" Тогда
		Объект.Пол = ДанныеФизЛица.Пол;
	КонецЕсли;
	
	Если ДанныеФизЛица.ИНН <> "" Тогда
		Объект.ИНН = ДанныеФизЛица.ИНН;
	КонецЕсли;
	
	Если ДанныеФизЛица.СНИЛС <> "" Тогда
		Объект.СНИЛС = ДанныеФизЛица.СНИЛС;
	КонецЕсли;
	
	Если ДанныеФизЛица.МедПолисНомер <> "" Тогда
		Объект.МедПолисНомер = ДанныеФизЛица.МедПолисНомер;
	КонецЕсли;
	
	Если ДанныеФизЛица.МедПолисСерия <> "" Тогда
		Объект.МедПолисСерия = ДанныеФизЛица.МедПолисСерия;
	КонецЕсли;
	
	Если ДанныеФизЛица.Паспорт <> "" Тогда
		Объект.Паспорт = ДанныеФизЛица.Паспорт;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФизЛица(ФизЛицо)
	ДанныеФизЛица = Новый Структура;
	ДанныеФизЛица.Вставить("ФИО", ФизЛицо.Наименование);
	ДанныеФизЛица.Вставить("ДатаРождения", ФизЛицо.ДатаРождения);
	ДанныеФизЛица.Вставить("Пол", ФизЛицо.Пол);
	ДанныеФизЛица.Вставить("ИНН", ФизЛицо.ИНН);
	ДанныеФизЛица.Вставить("СНИЛС", ФизЛицо.СНИЛС);
	ДанныеФизЛица.Вставить("МедПолисНомер", ФизЛицо.МедПолисНомер);
	ДанныеФизЛица.Вставить("МедПолисСерия", ФизЛицо.МедПолисСерия);
	ДанныеФизЛица.Вставить("Паспорт", ФизЛицо.Паспорт);
	Возврат ДанныеФизЛица;
КонецФункции
