
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ИзменитьСтатусыГруппы(Объект.ЗачислениеВГруппу);
	Для Каждого СтрочкаСтудента из Объект.СписокСтудентов Цикл
		ЗаписатьИнформациюНаСтудента(СтрочкаСтудента.Студент);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусыГруппы(Группа)
	ГруппаОбъект = Группа.ПолучитьОбъект();
	ГруппаОбъект.Статус = Перечисления.СтатусыГрупп.Выпустилась;
	ГруппаОбъект.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьИнформациюНаСтудента(Студент)
	СтудентСсылка = Студент;
	СтудентОбъект = СтудентСсылка.ПолучитьОбъект();
	
	СтудентОбъект.Отделение = "";
	СтудентОбъект.ВидФинансирования = "";
	СтудентОбъект.ТекущаяПрограммаОбучения = "";
	СтудентОбъект.УчебнаяГруппа = "";
	СтудентОбъект.Специальность = "";
	СтудентОбъект.Курс = "";
	СтудентОбъект.СтатусСтудента = Перечисления.СтатусыСтудента.Выпущен;
	
	СтудентОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОткрытьФорму(ДвижениеКонтингента.ПолучитьФормуИзВидаПриказа(ВыбранноеЗначение));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().Выпуск;
	Объект.СтатусСтудента = ДвижениеКонтингента.ПолучитьСтатусыСтудента().Выпущен;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуНаСервере(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Студент,
		|	Студенты.ВидФинансирования КАК ВидФинансирования,
		|	Студенты.УчебнаяГруппа КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.УчебнаяГруппа = &УчебнаяГруппа;";
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", Группа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	// ДокОбъект.СписокСтудентов.Загрузить(Запрос.Выполнить().Выгрузить());
	// ЗначениеВДанныеФормы(ДокОбъект, "Объект");
	Пока Выборка.Следующий() Цикл
        НовСтр = Объект.СписокСтудентов.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппу(Команда)
	ЗаполнитьГруппуНаСервере(Объект.ЗачислениеВГруппу);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтедениеГруппы(Группа)
	Возврат Группа.Отделение;
КонецФункции

&НаКлиенте
Процедура ЗачислениеВГруппуПриИзменении(Элемент)
	Объект.Отделение = ПолучитьОтедениеГруппы(Объект.ЗачислениеВГруппу);
КонецПроцедуры
