
&НаКлиенте
Процедура СрокОбученияПриИзменении(Элемент)
	Объект.СрокОбученияСлитно = "" + Объект.ЛетОбучения + " года " + Объект.МесяцевОбучения + " месяцев";
КонецПроцедуры

&НаКлиенте
Процедура СрокОбученияСлитноПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ЛетОбучения = НайтиЧислаВСтроке(Объект.СрокОбученияСлитно, 0);
	Объект.МесяцевОбучения = НайтиЧислаВСтроке(Объект.СрокОбученияСлитно, 1);
КонецПроцедуры

Функция НайтиЧислаВСтроке(Строка, Номер)
   МассивЧисел = Новый Массив; // сюда поместим все найденные числа
   СтрокаЧисел = "";
   Для Индекс = 1 По СтрДлина(Строка) Цикл
      Символ = Сред(Строка, Индекс, 1); // Перебираем все символы из нашей строки
      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(Число(СтрокаЧисел));
         СтрокаЧисел = "";
      КонецЕсли;
   КонецЦикла;
   Возврат МассивЧисел[Номер]
КонецФункции

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Объект.Действует = Истина 
		Тогда ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Истина;
	Иначе 
		ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Ложь;
		Объект.НачалоСрокаОбучения = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ЭтаФорма.ЭтотОбъект.Элементы.НачалоСрокаОбучения.Доступность = Ложь;
КонецПроцедуры
