
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьНаправленияНаПересдачу)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаправленияНаПересдачу(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Печать направления на пересдачу");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьНаправленияНаПересдачу(ТабДок, ПараметрКоманды)
	Документы.НаправлениеНаПересдачу.ПечатьНаправленияНаПересдачу(ТабДок, ПараметрКоманды);
КонецПроцедуры
