
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСтудента из Объект.СписокСтудентов Цикл
		ВидФинансирования = Элементы.СписокСтудентов.ТекущиеДанные.ВидФинансирования;
		ЗаписатьИнформациюНаСтудента(СтрочкаСтудента.Студент, Объект.ЗачислениеВГруппу, ВидФинансирования);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнформациюНаСтудента(Студент, НоваяГруппа, ВидФинансирования)
	СтудентСсылка = Студент;
	СтудентОбъект = СтудентСсылка.ПолучитьОбъект();
	
	СтудентОбъект.Отделение = Объект.Отделение;
	СтудентОбъект.УчебнаяГруппа = НоваяГруппа;
	СтудентОбъект.ВидФинансирования = ВидФинансирования;
	СтудентОбъект.ТекущаяПрограммаОбучения = НоваяГруппа.ПрограммаОбучения;
	СтудентОбъект.Специальность = НоваяГруппа.ПрограммаОбучения.Специальность;
	
	СтудентОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОткрытьФорму(ДвижениеКонтингента.ПолучитьФормуИзВидаПриказа(ВыбранноеЗначение));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().ПереводВДругуюГруппу;
	Объект.СтатусСтудента = ДвижениеКонтингента.ПолучитьСтатусыСтудента().Студент;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтедениеГруппы(Группа)
	Возврат Группа.Отделение;
КонецФункции

&НаКлиенте
Процедура ЗачислениеВГруппуПриИзменении(Элемент)
	Объект.Отделение = ПолучитьОтедениеГруппы(Объект.ЗачислениеВГруппу);
КонецПроцедуры

